public/ephemeris/2025-06-05.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-orgd9aff99" class="outline-2">
<h2 id="orgd9aff99">2025-06-05 - Last University lesson</h2>
<div class="outline-text-2" id="text-orgd9aff99">
<p>
Yesterday I had my last class lecture of my bachelor degree in
computer science. This concludes a period of three years where I
dedicated all my time to studying and mastering my crafts.  From my
part, I rarely skipped a lesson. In fact, I count less than 10 lessons
I did not attend for various reasons often not in my control, I have
always showed up even when I did not feel like going and that kept me
motivated to push through all my exams. Now I will take some time to
reflect on what has been, all while studying for my last three exams.
</p>

<p>
What I am most grateful for is being able to dedicate to my studies
fully, which is really a privilege and it won't happen again, I am on
my own now. In three years I rarely "unfocused" and when that happens
I would feel lost, thankfully I could dedicate my entire wake time and
my energies to programming and studying programming and open source
projects which is so important for me.
</p>

<p>
Did everything go smoothly? Was everything the best it could have
been? Absolutely no, yet I stopped thinking about what could have
been and instead I learned to appreciate what I have now. Probably
about 80% to 90% of my time getting this piece of paper of a degree
was not worth it, I had so many terrible exams where I learned
nothing, yet I did so much more outside university like a graphics
engine, an operating system, I hacked with the Linux kernel for
hundreds of hours and I have developed some expertise through these
projects.
</p>

<p>
If you don't know, Italian universities are very theoretical. I didn't
do many projects, anyone could get this degree with very little
knowledge of programming. Exams are hard, sometimes unreasonably hard
depending on the professor, and the future is really uncertain for
students unless you emigrate to other nations. Such is the situation,
or at least how I am perceiving this right now. You see me complaining
now, however I rarely rant on things; I prefer getting things done
without much talk.
</p>

<p>
Even if I have so much to learn, I now know a little bit more than
before. It never feels enough, but It is progress and I trust the
process.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
